---
kind: method
id: M:Autodesk.Revit.DB.LinkElementId.#ctor(Autodesk.Revit.DB.ElementId)
source: html/c51f7e25-2106-0431-cefe-d004bf9ff0d0.htm
---
# Autodesk.Revit.DB.LinkElementId.#ctor Method

Creates a new LinkElementId representing an element in the host document.

## Syntax (C#)
```csharp
public LinkElementId(
	ElementId elementId
)
```

## Parameters
- **elementId** (`Autodesk.Revit.DB.ElementId`) - The id of the element in the host document.